tip/template/0/U
/*--------------------------------*- C++ -*----------------------------------*\
  =========                 |
  \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox
   \\    /   O peration     | Website:  https://openfoam.org
    \\  /    A nd           | Version:  8
     \\/     M anipulation  |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       volVectorField;
    location    "0";
    object      U;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

dimensions      [0 1 -1 0 0 0 0];

internalField  uniform (22.94397 1.60440 0.0 );

boundaryField
{
    "(INLET|BOTTOM)"
    {
        type            freestream;
        freestreamValue $internalField;
    }

    "(OUTLET|TOP)"
    {
        type            freestream;
        freestreamValue $internalField;
    }

    "(Wing.stl|Tips.stl)"
    {
        type            noSlip;
    }

    SYMMETRY
    {
        type            symmetryPlane;
    }

    WALL
    {
        type            slip;
    }

}


// ************************************************************************* //
