tip/template/0/k
/*--------------------------------*- C++ -*----------------------------------*\
  =========                 |
  \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox
   \\    /   O peration     | Website:  https://openfoam.org
    \\  /    A nd           | Version:  8
     \\/     M anipulation  |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       volScalarField;
    object      k;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

dimensions      [0 2 -2 0 0 0 0];

internalField   uniform 0.02;

boundaryField
{
    "(INLET|BOTTOM)"
    {
        type            freestream;
        freestreamValue $internalField;
    }

    "(OUTLET|TOP)"
    {
        type            freestream;
        freestreamValue $internalField;
    }

    "(Wing.stl|Tips.stl)"
    {
        type            kLowReWallFunction;
        value           $internalField;
    }

    SYMMETRY
    {
        type            symmetryPlane;
    }

    WALL
    {
        type            slip;
    }

}


// ************************************************************************* //
