tip/template/0/nut
/*--------------------------------*- C++ -*----------------------------------*\
  =========                 |
  \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox
   \\    /   O peration     | Website:  https://openfoam.org
    \\  /    A nd           | Version:  8
     \\/     M anipulation  |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       volScalarField;
    location    "0";
    object      nut;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

dimensions      [0 2 -1 0 0 0 0];

internalField   uniform 0;

boundaryField
{
    "(INLET|BOTTOM)"
    {
        type            calculated;
        value           uniform 0;
    }

    "(OUTLET|TOP)"
    {
        type            calculated;
        value           uniform 0;
    }

    "(Wing.stl|Tips.stl)"
    {
        type            nutUSpaldingWallFunction;
        value           uniform 0;
    }

    SYMMETRY
    {
        type            symmetryPlane;
    }

    WALL
    {
        type            calculated;
        value           uniform 0;
    }
}


// ************************************************************************* //
