tip/template/0/omega
/*--------------------------------*- C++ -*----------------------------------*\
  =========                 |
  \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox
   \\    /   O peration     | Website:  https://openfoam.org
    \\  /    A nd           | Version:  8
     \\/     M anipulation  |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       volScalarField;
    object      omega;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

dimensions      [0 0 -1 0 0 0 0];

internalField   uniform 10.4;

boundaryField
{
    "(INLET|BOTTOM)"
    {
        type            freestream;
        freestreamValue $internalField;
    }

    "(OUTLET|TOP)"
    {
        type            freestream;
        freestreamValue $internalField;
    }

    "(Wing.stl|Tips.stl)"
    {
        type            omegaWallFunction;
        value           $internalField;
    }

    SYMMETRY
    {
        type symmetryPlane;
    }

    WALL
    {
        type slip;
    }
}


// ************************************************************************* //
